test/rails/app/controllers/users_controller.rb

  def index
    search = Presenting::SearchConditions.new(:fields => {
      'first_name' => :equals,
      'last_name' => :begins_with,
      'email' => :not_null
    })

    @users = User.paginate(
      :page => params[:page],
      :per_page => 2,
      :conditions => search.to_conditions(params[:search], :field)
    )
---
SELECT * FROM "users" LIMIT 2 OFFSET 0
SELECT count(*) AS count_all FROM "users"